apemangr/Repetidor-nRF52-SDK-17.1.0/app_nus_server.c
					case 3:  // Comando 03: Reiniciar el dispositivo
						NRF_LOG_RAW_INFO(
						    "\n\n--- Comando 03 recibido: Reiniciando "
						    "dispositivo...\n\n\n\n");
						nrf_delay_ms(1000);
						NVIC_SystemReset();

						break;

					case 4:  // Guardar tiempo de encendido
					{
						if (p_evt->params.rx_data.length >=
						    6)  // Verifica que haya datos suficientes
						{
							char time_str[4] = {message[5], message[6],
							                    message[7], '\0'};
							uint32_t time_in_seconds
							    __attribute__((aligned(4))) =
							        atoi(time_str) * 1000;
							if (time_in_seconds <=
							    666000)  // Verifica que no exceda el máximo
							             // permitido
							{
								write_time_to_flash(TIEMPO_ENCENDIDO,
								                    time_in_seconds);
							}
							else
							{
								NRF_LOG_WARNING(
								    "El tiempo de encendido excede el máximo "
								    "permitido (666 segundos).");
							}
						}
						else
						{
							NRF_LOG_WARNING(
							    "Comando 04 recibido con datos insuficientes.");
						}
						break;
					}

					case 5:  // Comando 05: Leer tiempo de encendido desde la
					         // memoria flash
					{
						uint32_t on_time_ms =
						    read_on_time_from_flash(DEFAULT_DEVICE_ON_TIME_MS);

						// read_time_from_flash(
						//     TIEMPO_ENCENDIDO, DEFAULT_DEVICE_ON_TIME_MS);
						NRF_LOG_RAW_INFO(
						    "\n\n--- Comando 05 recibido: Tiempo de encendido "
						    "leido: %d ms.\n\n",
						    on_time_ms);
						break;
					}

					case 6:  // Comando 06: Guardar tiempo de apagado
					{
						if (p_evt->params.rx_data.length >=
						    6)  // Verifica que haya datos suficientes
						{
							char time_str[4] = {message[5], message[6],
							                    message[7], '\0'};
							uint32_t time_in_seconds
							    __attribute__((aligned(4))) =
							        atoi(time_str) * 1000;
							if (time_in_seconds <=
							    666000)  // Verifica que no exceda el máximo
							             // permitido
							{
								write_time_to_flash(TIEMPO_SLEEP,
								                    time_in_seconds);
							}
							else
							{
								NRF_LOG_WARNING(
								    "El tiempo de dormido excede el máximo "
								    "permitido (666 segundos).");
							}
						}
						else
						{
							NRF_LOG_WARNING(
							    "Comando 06 recibido con datos insuficientes.");
						}
						break;
					}

					case 7:  // Comando 07: Leer tiempo de apagado desde la
					         // memoria flash
					{
						uint32_t on_time_ms =
						    read_time_from_flash(TIEMPO_SLEEP, DEFAULT_DEVICE_SLEEP_TIME_MS);

						// read_time_from_flash(
						//     TIEMPO_ENCENDIDO, DEFAULT_DEVICE_ON_TIME_MS);
						NRF_LOG_RAW_INFO(
						    "\n\n--- Comando 07 recibido: Tiempo de dormido"
						    "leido: %d ms.\n\n",
						    on_time_ms);
						break;
					}

					default:  // Comando desconocido
						NRF_LOG_WARNING("Comando desconocido: %s", command);
						break;
				}
			}
			else
			{
				// Reenvía el mensaje al emisor o lo maneja normalmente
				if (m_on_data_received)
				{
					m_on_data_received((uint8_t*)message,
					                   p_evt->params.rx_data.length);
				}
			}
		}
		else
		{
			NRF_LOG_WARNING("Mensaje demasiado largo para procesar.");
		}
	}
}
/**@snippet [Handling the data received over BLE] */

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access
 * Profile) parameters of the device. It also sets the permissions and
 * appearance.
 */
static void gap_params_init(void)
{
	uint32_t err_code;
	ble_gap_conn_params_t gap_conn_params;
	ble_gap_conn_sec_mode_t sec_mode;

	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

	err_code = sd_ble_gap_device_name_set(
	    &sec_mode, (const uint8_t*)DEVICE_NAME, strlen(DEVICE_NAME));
	APP_ERROR_CHECK(err_code);

	memset(&gap_conn_params, 0, sizeof(gap_conn_params));

	gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
	gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
	gap_conn_params.slave_latency = SLAVE_LATENCY;
	gap_conn_params.conn_sup_timeout = CONN_SUP_TIMEOUT;

	err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
	APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing services that will be used by the
 * application.
 */
static void services_init(void)
{
	uint32_t err_code;
	ble_nus_init_t nus_init;
	nrf_ble_qwr_init_t qwr_init = {0};

	// Initialize Queued Write Module.
	qwr_init.error_handler = nrf_qwr_error_handler;

	err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
	APP_ERROR_CHECK(err_code);

	// Initialize NUS.
	memset(&nus_init, 0, sizeof(nus_init));

	nus_init.data_handler = nus_data_handler;

	err_code = ble_nus_init(&m_nus, &nus_init);
	APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling an event from the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection
 * Parameters Module which are passed to the application.
 *
 * @note All this function does is to disconnect. This could have been done by
 * simply setting the disconnect_on_fail config parameter, but instead we use
 * the event handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
static void on_conn_params_evt(ble_conn_params_evt_t* p_evt)
{
	uint32_t err_code;

	if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
	{
		err_code = sd_ble_gap_disconnect(m_conn_handle,
		                                 BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
		APP_ERROR_CHECK(err_code);
	}
}

/**@brief Function for handling errors from the Connection Parameters module.
 *
 * @param[in] nrf_error  Error code containing information about what went
 * wrong.
 */
static void conn_params_error_handler(uint32_t nrf_error)
{
	APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for initializing the Connection Parameters module.
 */
static void conn_params_init(void)
{
	uint32_t err_code;
	ble_conn_params_init_t cp_init;

	memset(&cp_init, 0, sizeof(cp_init));

	cp_init.p_conn_params = NULL;
	cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
	cp_init.next_conn_params_update_delay = NEXT_CONN_PARAMS_UPDATE_DELAY;
	cp_init.max_conn_params_update_count = MAX_CONN_PARAMS_UPDATE_COUNT;
	cp_init.start_on_notify_cccd_handle = BLE_GATT_HANDLE_INVALID;
	cp_init.disconnect_on_fail = false;
	cp_init.evt_handler = on_conn_params_evt;
	cp_init.error_handler = conn_params_error_handler;

