apemangr/Repetidor-nRF52-SDK-17.1.0/app_nus_server.c
	err_code = ble_conn_params_init(&cp_init);
	APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling advertising events.
 *
 * @details This function will be called for advertising events which are passed
 * to the application.
 *
 * @param[in] ble_adv_evt  Advertising event.
 */
static void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
	uint32_t err_code;

	switch (ble_adv_evt)
	{
		case BLE_ADV_EVT_FAST:
			err_code = bsp_indication_set(BSP_INDICATE_ADVERTISING);
			APP_ERROR_CHECK(err_code);
			break;
		case BLE_ADV_EVT_IDLE:
			// sleep_mode_enter();
			break;
		default:
			break;
	}
}

/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 */
void app_nus_server_ble_evt_handler(ble_evt_t const* p_ble_evt)
{
	uint32_t err_code;
	ble_gap_evt_t const* p_gap_evt = &p_ble_evt->evt.gap_evt;

	switch (p_ble_evt->header.evt_id)
	{
		case BLE_GAP_EVT_CONNECTED:
			if (p_gap_evt->params.connected.role == BLE_GAP_ROLE_PERIPH)
			{
				NRF_LOG_RAW_INFO("\nCelular conectado\n");
				m_conn_handle = p_ble_evt->evt.gap_evt
				                    .conn_handle;  // Guardar handle del celular
			}
			else if (p_gap_evt->params.connected.role == BLE_GAP_ROLE_CENTRAL)
			{
				NRF_LOG_RAW_INFO("\nEmisor conectado\n");
				m_emisor_conn_handle =
				    p_ble_evt->evt.gap_evt
				        .conn_handle;  // Guardar handle del emisor
			}
			break;

		case BLE_GAP_EVT_DISCONNECTED:
			if (p_gap_evt->conn_handle == m_conn_handle)
			{
				NRF_LOG_RAW_INFO("\nCelular desconectado\n");
				m_conn_handle =
				    BLE_CONN_HANDLE_INVALID;  // Invalida el handle del celular
			}
			else if (p_gap_evt->conn_handle == m_emisor_conn_handle)
			{
				NRF_LOG_RAW_INFO("\nEmisor desconectado");
				NRF_LOG_RAW_INFO("\n\nBuscando emisor...\n");

				m_emisor_conn_handle =
				    BLE_CONN_HANDLE_INVALID;  // Invalida el handle del emisor
			}
			break;

		case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
		{
			NRF_LOG_DEBUG("PHY update request.");
			ble_gap_phys_t const phys = {
			    .rx_phys = BLE_GAP_PHY_AUTO,
			    .tx_phys = BLE_GAP_PHY_AUTO,
			};
			err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle,
			                                 &phys);
			APP_ERROR_CHECK(err_code);
		}
		break;

		case BLE_GAP_EVT_SEC_PARAMS_REQUEST:
			// Pairing not supported
			err_code = sd_ble_gap_sec_params_reply(
			    m_conn_handle, BLE_GAP_SEC_STATUS_PAIRING_NOT_SUPP, NULL, NULL);
			APP_ERROR_CHECK(err_code);
			break;

		case BLE_GATTS_EVT_SYS_ATTR_MISSING:
			// No system attributes have been stored.
			err_code = sd_ble_gatts_sys_attr_set(m_conn_handle, NULL, 0, 0);
			APP_ERROR_CHECK(err_code);
			break;

		case BLE_GATTC_EVT_TIMEOUT:
			// Disconnect on GATT Client timeout event.
			err_code = sd_ble_gap_disconnect(
			    p_ble_evt->evt.gattc_evt.conn_handle,
			    BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
			APP_ERROR_CHECK(err_code);
			break;

		case BLE_GATTS_EVT_TIMEOUT:
			// Disconnect on GATT Server timeout event.
			err_code = sd_ble_gap_disconnect(
			    p_ble_evt->evt.gatts_evt.conn_handle,
			    BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
			APP_ERROR_CHECK(err_code);
			break;

		default:
			// No implementation needed.
			break;
	}
}

uint32_t app_nus_server_send_data(const uint8_t* data_array, uint16_t length)
{
	return ble_nus_data_send(&m_nus, (uint8_t*)data_array, &length,
	                         m_conn_handle);
}

/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
	uint32_t err_code;
	ble_advertising_init_t init;

	memset(&init, 0, sizeof(init));

	init.advdata.name_type = BLE_ADVDATA_FULL_NAME;
	init.advdata.include_appearance = false;
	init.advdata.flags = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

	init.config.ble_adv_on_disconnect_disabled = true;

	init.srdata.uuids_complete.uuid_cnt =
	    sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
	init.srdata.uuids_complete.p_uuids = m_adv_uuids;

	init.config.ble_adv_fast_enabled = true;
	init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
	init.config.ble_adv_fast_timeout = APP_ADV_DURATION;
	init.evt_handler = on_adv_evt;

	err_code = ble_advertising_init(&m_advertising, &init);
	APP_ERROR_CHECK(err_code);

	ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}

/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
	uint32_t err_code =
	    ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
	APP_ERROR_CHECK(err_code);
}

void app_nus_server_init(app_nus_server_on_data_received_t on_data_received)
{
	m_on_data_received = on_data_received;
	gap_params_init();
	services_init();
	advertising_init();
	conn_params_init();
	fds_initialize();
	NRF_LOG_RAW_INFO(
	    "\n------------------------------------------------------");
	advertising_start();
}
